## Staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 9 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                              |
|--------|---------------------------------------------------------------|
| add    | `aws_route53_record.bounce-custom-notification-sandbox-MX[0]` |
|        | `aws_route53_record.bounce-notification-sandbox-MX[0]`        |
|        | `aws_route53_record.bounce-notification-sandbox-TXT[0]`       |
|        | `aws_route53_record.custom-domain-aws-ses-sandbox-TXT[0]`     |
|        | `aws_route53_record.custom-domain-ses-sandbox-TXT[0]`         |
|        | `aws_route53_record.dmarc-notification-sandbox-TXT[0]`        |
|        | `aws_route53_record.notification-sandbox-MX[0]`               |
|        | `aws_route53_record.notification-sandbox-TXT[0]`              |
|        | `aws_route53_record.ses-notification-sandbox-TXT[0]`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.bounce-custom-notification-sandbox-MX[0] will be created
  + resource "aws_route53_record" "bounce-custom-notification-sandbox-MX" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bounce.custom-sending-domain.staging.notification.cdssandbox.xyz"
      + records         = [
          + "10 feedback-smtp.ca-central-1.amazonses.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.bounce-notification-sandbox-MX[0] will be created
  + resource "aws_route53_record" "bounce-notification-sandbox-MX" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bounce.staging.notification.cdssandbox.xyz"
      + records         = [
          + "10 feedback-smtp.ca-central-1.amazonses.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.bounce-notification-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "bounce-notification-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bounce.staging.notification.cdssandbox.xyz"
      + records         = [
          + "v=spf1 include:amazonses.com ~all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.custom-domain-aws-ses-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "custom-domain-aws-ses-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_amazonses.custom-sending-domain.staging.notification.cdssandbox.xyz"
      + records         = [
          + "fXT/J45wZcUoBSnJAwPyfnHVf5E2b7aNayCC5PeQltg=",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.custom-domain-ses-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "custom-domain-ses-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "custom-sending-domain.staging.notification.cdssandbox.xyz"
      + records         = [
          + "amazonses:fXT/J45wZcUoBSnJAwPyfnHVf5E2b7aNayCC5PeQltg=",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.dmarc-notification-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "dmarc-notification-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc.staging.notification.cdssandbox.xyz"
      + records         = [
          + "v=DMARC1; p=reject; sp=reject; pct=100; rua=mailto:dmarc@cyber.gc.ca; ruf=mailto:dmarc@cyber.gc.ca",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-sandbox-MX[0] will be created
  + resource "aws_route53_record" "notification-sandbox-MX" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.notification.cdssandbox.xyz"
      + records         = [
          + "10 inbound-smtp.us-east-1.amazonaws.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "notification-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.notification.cdssandbox.xyz"
      + records         = [
          + "google-site-verification=u0zkO-jbYi1qW2G65mfXbuNl14BCO1O9uk-BV2wTlD8",
          + "v=spf1 include:amazonses.com ~all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.ses-notification-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "ses-notification-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_amazonses.staging.notification.cdssandbox.xyz"
      + records         = [
          + "AwTGEoIByR4QGirawhDmRdJmxFO/U0fX3NMrSOJpuI4=",
          + "vJFwJM0wnPRWKFXsoiVl9/gLXFP4RL5Xfl4C9JTp3VI=",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.dev_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.pond_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.production_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.scratch_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.staging_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-sandbox[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
